DataProcessors/УправлениеКампаниями.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<DataProcessor>		<InternalInfo>			<xr:GeneratedType name="DataProcessorObject.УправлениеКампаниями" category="Object">				<xr:TypeId>27a4e930-9bf7-48f5-aab0-88c85eaf43d6</xr:TypeId>				<xr:ValueId>357b00b7-7aff-414f-ba11-dc27e9181cd8</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DataProcessorManager.УправлениеКампаниями" category="Manager">				<xr:TypeId>274f6414-b295-4660-942c-099c939e37d9</xr:TypeId>				<xr:ValueId>083fb909-8e33-48bf-9d3e-12ec63ca0ab8</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>УправлениеКампаниями</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Управление кампаниями</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Managing of campaigns</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm>DataProcessor.УправлениеКампаниями.Form.Форма</DefaultForm>			<AuxiliaryForm/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Form>Форма</Form>			<Command>				<Properties>					<Name>УправлениеКампаниями</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Управление кампаниями</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Managing of campaigns</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Group>NavigationPanelImportant</Group>					<CommandParameterType/>					<ParameterUseMode>Single</ParameterUseMode>					<ModifiesData>false</ModifiesData>					<Representation>Auto</Representation>					<ToolTip/>					<Picture/>					<Shortcut/>					<OnMainServerUnavalableBehavior>Auto</OnMainServerUnavalableBehavior>				</Properties>			</Command>		</ChildObjects>	</DataProcessor></MetaDataObject>

AccumulationRegisters/Кампании.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<AccumulationRegister>		<InternalInfo>			<xr:GeneratedType name="AccumulationRegisterRecord.Кампании" category="Record">				<xr:TypeId>e2734ad6-80b9-4688-aad8-cebe929919b5</xr:TypeId>				<xr:ValueId>779ea25b-6dab-4e91-8439-2900a65d7504</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterManager.Кампании" category="Manager">				<xr:TypeId>e93381f8-5a94-4878-966d-7aef54fe1309</xr:TypeId>				<xr:ValueId>19478f29-2801-41e6-b417-f7f2d4b16e87</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterSelection.Кампании" category="Selection">				<xr:TypeId>47e8e0ff-f276-4b58-a233-5812bbc3c787</xr:TypeId>				<xr:ValueId>105585a5-abcf-490a-8542-d4f96436cd73</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterList.Кампании" category="List">				<xr:TypeId>94126ad6-fbcf-4bdd-8e01-9b1479dbccb9</xr:TypeId>				<xr:ValueId>b1860b9c-438a-4b47-a6c0-e38ebe80e09e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordSet.Кампании" category="RecordSet">				<xr:TypeId>6d647c3f-3f0a-43ff-aad3-26410d9397cd</xr:TypeId>				<xr:ValueId>d70c3e32-eab7-4f65-b2fc-abfad443988c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordKey.Кампании" category="RecordKey">				<xr:TypeId>adce50af-5837-42e3-98c7-82ad421249ac</xr:TypeId>				<xr:ValueId>24966b88-4c58-4087-973e-82312b31e495</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>Кампании</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Кампании</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Campaigns</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultListForm/>			<AuxiliaryListForm/>			<RegisterType>Balance</RegisterType>			<IncludeHelpInContents>false</IncludeHelpInContents>			<StandardAttributes>				<xr:StandardAttribute name="RecordType">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSplitting>true</EnableTotalsSplitting>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Количество</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Количество</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Quantity</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:decimal</v8:Type>						<v8:NumberQualifiers>							<v8:Digits>10</v8:Digits>							<v8:FractionDigits>0</v8:FractionDigits>							<v8:AllowedSign>Any</v8:AllowedSign>						</v8:NumberQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Order</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Кампания</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Кампания</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Campaign</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Кампании</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>		</ChildObjects>	</AccumulationRegister></MetaDataObject>

DataProcessors/УправлениеКампаниями/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьСпискомЗаказов(Команда)
	ПередаваемыеПараметры = Новый Структура();
	
	Колонки = Новый Структура;
	Колонки.Вставить("VIN"			, "VIN");
	
	ПередаваемыеПараметры.Вставить("Колонки", Колонки);
	
	ШиринаКолонок = Новый Структура("VIN",20);
	
	ПередаваемыеПараметры.Вставить("ШиринаКолонок", ШиринаКолонок);
	
	// ПередаваемыеПараметры.Вставить("Каталог", КаталогВременныхФайлов());
	ПередаваемыеПараметры.Вставить("Каталог", "");
	
	ПередаваемыеПараметры.Вставить("ПоказыватьФлагОчищать", Ложь);
	
	РаботаСДиалогамиКлиент.ОткрытьФормуЗагрузки(ЭтаФорма, ПередаваемыеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ЭтаФорма = Источник Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПереданыДанныеИзФормыЗагрузки" Тогда
		ТекстСообщения = "";
		Успешно =  ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр,ТекстСообщения);
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСТР("ru='"+ТекстСообщения+"';en='"+ТекстСообщения+"'"));
		КонецЕсли; 
	КонецЕсли;
	Если Успешно Тогда
		ПоказатьПредупреждение(,НСтр("ru='Заказы добавлены.';en='Orders were added.'"));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Заказы не добавлены.';en='Orders were not added.'"));
	КонецЕсли; 
КонецПроцедуры
&НаСервере
Функция ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр,ТекстСообщения)
	ТекстСообщения = "";
	
	СтруктураВозврата = ПолучитьИзВременногоХранилища(Параметр);
	НеНайденныеVIN = "";
	НомерСТроки = 0;
	Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	СписокVIN = СтруктураВозврата.ТаблицаДанных.ВыгрузитьКолонку("VIN");
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеЗаказовОстатки.Заказ КАК Заказ,
		|	ДвижениеЗаказовОстатки.ТочкаРегистрации КАК ТочкаРегистрации
		|ИЗ
		|	РегистрНакопления.ДвижениеЗаказов.Остатки(, ) КАК ДвижениеЗаказовОстатки
		|ГДЕ
		|	ДвижениеЗаказовОстатки.Заказ.VIN В(&СписокVIN)
		|	И ДвижениеЗаказовОстатки.КоличествоОстаток > 0";

	Запрос.УстановитьПараметр("СписокVIN", СписокVIN);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	СчетчикДобавленных = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ДобавитьЗаказ(ВыборкаДетальныеЗаписи.Заказ) Тогда
			СчетчикДобавленных = СчетчикДобавленных + 1;
		КонецЕсли; 
		
	КонецЦикла;
	ТекстСообщения = НСтр("ru='Заказов добавлено: ';en='Orders were added: '")+СчетчикДобавленных;
	Если СчетчикДобавленных=0 Тогда
		Возврат Ложь;
	КонецЕсли; 
	ОбновитьСостояниеЗаказаВКомпании();	
	Возврат Истина;
КонецФункции

&НаСервере
Функция ДобавитьЗаказ(Заказ)
	ПараметрыОтбора = новый Структура("Заказ",Заказ);
	НайденныеСтроки = ВыбранныеЗаказы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()=0 Тогда
		НоваяСтрока = ВыбранныеЗаказы.Добавить();
		НоваяСтрока.Заказ = Заказ;
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеЗаказаВКомпании()
	Если Не ЗначениеЗаполнено(Кампания) Тогда
		Для каждого СтрокаСЗаказом Из ВыбранныеЗаказы Цикл
			СтрокаСЗаказом.КампанияУстановлена = Ложь;
		КонецЦикла; 
		Возврат;
	КонецЕсли; 
	
	СписокЗаказов = ВыбранныеЗаказы.Выгрузить().ВыгрузитьКолонку("Заказ");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КампанииОстатки.Заказ
		|ИЗ
		|	РегистрНакопления.Кампании.Остатки(
		|			,
		|			Заказ В (&СписокЗаказов)
		|				И Кампания = &Кампания) КАК КампанииОстатки
		|ГДЕ
		|	КампанииОстатки.КоличествоОстаток > 0";

	Запрос.УстановитьПараметр("Кампания", Кампания);
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);

	ЗаказыСУстановленнойКампанией = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	
	Для каждого строкаСЗаказом Из ВыбранныеЗаказы Цикл
		Если ЗаказыСУстановленнойКампанией.Найти(СтрокаСЗаказом.Заказ)= Неопределено Тогда
			СтрокаСЗаказом.КампанияУстановлена = Ложь;
		Иначе	
			СтрокаСЗаказом.КампанияУстановлена = Истина;
		КонецЕсли; 
	КонецЦикла; 
	Элементы.ОстаткиЗаказов.Обновить();
	Элементы.ДвиженияЗаказов.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКампанию(Команда)
	
	ТекстСообщения = "";
	Успешно = ИзменитьКампанию_Сервер(Истина,ТекстСообщения);
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСТР("ru='"+ТекстСообщения+"';en='"+ТекстСообщения+"'"));
	КонецЕсли; 
	
	Если Успешно Тогда
		ПоказатьПредупреждение(,НСтр("ru='Операция выполнена';en='Operation was executed'"));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Операция не выполнена';en='Operation was not executed'"));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьКампанию(Команда)
	ТекстСообщения = "";
	Успешно = ИзменитьКампанию_Сервер(Ложь,ТекстСообщения);
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСТР("ru='"+ТекстСообщения+"';en='"+ТекстСообщения+"'"));
	КонецЕсли; 
	
	Если Успешно Тогда
		ПоказатьПредупреждение(,НСтр("ru='Операция выполнена';en='Operation was executed'"));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Операция не выполнена';en='Operation was not executed'"));
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Функция ИзменитьКампанию_Сервер(УстановкаКампании,ТекстСообщения)
	
	Если Не ЗначениеЗаполнено(Кампания) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана кампания';en='Campaign is not chosen'");
		Возврат ложь;
	КонецЕсли; 
	
	Для каждого СтрокаСЗаказом Из ВыбранныеЗаказы Цикл
		
		ДокКампания = документы.ОперацияПоКампании.СоздатьДокумент();
		ДокКампания.Дата = ТекущаяДата();
		ДокКампания.Заказ = СтрокаСЗаказом.Заказ;
		ДокКампания.Кампания = Кампания;
		ДокКампания.ОперацияКампании = ?(УстановкаКампании,Перечисления.ОперацииКампании.Установка,Перечисления.ОперацииКампании.Снятие);
		ДокКампания.ДополнительныеСвойства.Вставить("ОтключитьКонтрольОстатков",Истина);
		Попытка
			ДокКампания.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		Исключение
		    ТекстСообщения = ТекстСообщения + ОписаниеОшибки() + Символы.ПС;
		КонецПопытки;
				
	КонецЦикла; 
	
	ОбновитьСостояниеЗаказаВКомпании();
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура КампанияПриИзменении(Элемент)
	УстановитьПараметрыДинамическихСписков();
	ОбновитьСостояниеЗаказаВКомпании();
КонецПроцедуры


&НаКлиенте
Процедура КампанияОчистка(Элемент, СтандартнаяОбработка)
	УстановитьПараметрыДинамическихСписков();
	ОбновитьСостояниеЗаказаВКомпании();
КонецПроцедуры


&НаКлиенте
Процедура ДвиженияЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьЗаказИзДинамическогоСписка(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписков()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДвиженияЗаказов,"Кампания",Кампания);
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиЗаказов,"Кампания",Кампания);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиЗаказов,"Дата",?(ЗначениеЗаполнено(ДатаПолученияОстатков),ДатаПолученияОстатков,ТекущаяДата()+1));
КонецПроцедуры
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЗаказовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ДобавитьЗаказИзДинамическогоСписка(Элемент, Значение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаказИзДинамическогоСписка(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка)
	КоличествоДобавлено = 0;
	СтандартнаяОбработка = Ложь;
	Для каждого НомерСтроки Из ВыбраннаяСтрока Цикл
		ТекСтрока = Элемент.ДанныеСтроки(НомерСтроки);
		Если ДобавитьЗаказ(ТекСтрока.Заказ) Тогда
			КоличествоДобавлено = КоличествоДобавлено + 1;
		КонецЕсли; 
	КонецЦикла;
	ОбновитьСостояниеЗаказаВКомпании();
	Состояние(НСтр("ru='Заказов добавлено: ';en='Orders were added: '")+КоличествоДобавлено);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПолученияОстатковПриИзменении(Элемент)
	УстановитьПараметрыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПолученияОстатковОчистка(Элемент, СтандартнаяОбработка)
	УстановитьПараметрыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиЗаказовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ДобавитьЗаказИзДинамическогоСписка(Элемент, Значение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьЗаказИзДинамическогоСписка(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка);
КонецПроцедуры
